'use client'
import DynamicToastViewer from '@/components/DynamicToastViewer'

const UsagePolicy = () => {
  const policy: string = `
  # peer 이용약관

> 마지막 업데이트 2024.02.04 

> 공고 : 2024년 2월 5일

> 시행 : 2024년 2월 5일

## peer를 찾아주셔서 감사합니다.

peer(이하 ‘피어’)를 방문하신 여러분을 환영합니다. 이 약관은 피어가 제공하는 서비스를 회원 또는 비회원 이용자가 보다 효과적이고 안전하게 누리는데 도움이 되는 정보를 담고 있습니다.

본 이용 약관은 사용자의 서비스 이용 및 운영에 대한 규정, 책임, 의무를 포함하고 있습니다. 이용자로서 서비스를 이용하기 위하여 본 약관에 동의가 반드시 필요 합니다. 따라서 본 내용을 신중하게 읽어주시고 이용자의 권리, 의무, 보호정책들을 신중하게 숙지 부탁드립니다.

## 피어가 제공하는 다양한 서비스를 이용해보세요.
피어는 피어 웹 어플리케이션 서비스를 통해 정보 플랫폼으로서 다양한 서비스를 제공하고 있습니다. 이용자는 피어의 서비스를 자유롭게 이용할 수 있으며, 개별 서비스의 구체적인 내용은 각 서비스의 안내문, 공지사항, 운영 규정 등을 통해 확인할 수 있습니다. 

## 피어 회원으로 가입하시면 피어의 모든 서비스를 보다 효과적으로 이용하실 수 있습니다.
이용자들은 이 약관을 읽고 동의하신 후에 회원가입을 신청하실 수 있습니다. 피어가 여러분의 회원 신청정보 등을 확인하고 승낙하면 회원 가입 절차가 완료됩니다. 피어는 피어 회원에게 서비스 이용계정을 부여하고 회원은 이 계정을 이용하여 피어가 제공하는 서비스를 좀 더 편리하게 이용할 수 있습니다.

## 여러분이 피어를 통해 공유하는 컨텐츠에 대한 권리와 책임은 여러분에게 있습니다.
여러분은 사진, 글, 정보, 영상 등의 컨텐츠를 피어와 피어가 제공하는 여러 서비스에 게시할 수 있으며 이러한 게시물에 대한 저작권을 포함한 지적재산권은 권리자가 계속하여 보유합니다.

피어를 통해 여러분이 제공한 게시물을 적법하게 공유하려면 해당 컨텐츠에 대한 저장, 복제, 수정, 공중 송신, 전시, 배포 등의 이용 권한(기한과 지역 제한에 정함이 없으며, 별도 대가 지급이 없는 라이선스)이 필요합니다. 게시물 게재로 여러분은 피어에게 그러한 권한을 부여하게 되므로, 여러분은 이에 필요한 권리를 보유하고 있어야 합니다. 이러한 권리를 보유하지 않아 발생하는 모든 문제에 대해서는 게시자가 책임을 부담하게 됩니다.

피어는 여러분이 부여해 주신 콘텐츠 이용 권한을 저작권법 등 관련 법령에서 정하는 바에 따라 피어 서비스 내 노출, 서비스 홍보를 위한 활용, 서비스 운영, 개선 및 새로운 서비스 개발을 위한 연구, 웹 접근성 등 법률상 의무 준수, 외부 사이트에서의 검색, 수집 및 링크 허용을 위해서만 제한적으로 행사할 것입니다. 만약, 그 밖의 목적을 위해 부득이 여러분의 콘텐츠를 이용하고자 할 경우엔 사전에 여러분께 설명을 드리고 동의를 받도록 하겠습니다.

또한 여러분이 제공한 소중한 콘텐츠는 피어 서비스를 개선하고 새로운 피어 서비스를 제공하기 위해 연구 개발 목적으로 피어에서 사용될 수 있습니다. 피어는 지속적인 연구 · 개발을 통해 여러분께 좀 더 편리하고 유용한 서비스를 제공해 드릴 수 있도록 최선을 다하겠습니다.

## 피어 서비스에는 광고가 게재되어 있습니다.
피어 서비스에는 다양한 종류의 광고가 개재 될 수 있습니다. 이는 피어 서비스의 운영을 위하여 사용 될 수 있으며,  제공하는 피어 서비스를 원칙적으로 무료로 제공할 수 있게 해주는 데 기여합니다. 더 나아가 피어가 연구 개발에 투자하여 더 나은 서비스를 제공할 수 있는 기반이 됩니다.

피어는 더 나은 서비스의 제공을 위하여 여러분에게 서비스의 이용과 관련된 각종 고지, 관리 메시지 및 기타 광고를 비롯한 다양한 정보를 서비스 내에 표시하거나 여러분의 피어 계정 정보에 등록되어 있는 연락처로 직접 발송할 수 있습니다. 단, 광고성 정보 전송의 경우에는 사전에 수신에 동의한 경우에만 전송합니다.

피어는 사이트 등에 게재되어 있는 광고주의 홍보활동에 개인회원이 참여하거나 교신 또는 거래를 함으로써 발생하는 상황들에 대하여 책임이 없으며, 광고 개재 시 적법한 광고인지 여부만을 검토 및 판단하여 개제합니다. 광고를 통해 접속된 서비스와 이해 당사자간의 발생하는 상황들에 대하여 책임이 없고, 이에 대한 민형사적 갈등에 대해서는 이해당사자들 사이의 문제임을 알립니다. 그러나 아래의 경우 피어는 해당 상황에 대해 개입될 여지가 발생합니다.

1. 개제한 광고가 법적 테두리를 벗어나는 내용을 담고 있으나, 이를 어떤 이유에서든지 개제하였을 때 생기는 문제들에 대하여 소명 및 이용자들의 권익 보호에 힘써야 합니다.
2. 광고가 혐오, 증오, 범죄 장려와 같은 내용으로 변동 시 이에 대해서 적극적으로 광고 검열을 진행하며, 서비스 이용자로 하여금 불쾌감, 옳지 못한 정보등을 전달하지 않도록 최대한 노력합니다. 

## 피어 서비스를 이용하실 때, 반드시 알고 계셔야 하는 주의사항이 있습니다.
① 허위 정보를 기재하여 회원 가입 신청을 해서는 안 됩니다. 또한 자신의 계정을 다른 사람에게 판매, 양도, 대여 또는 담보로 제공하거나 다른 사람에게 그 사용을 허락해서는 안 됩니다. 아울러 자신의 계정이 아닌 타인의 계정을 무단으로 사용해서는 안 됩니다.

② 타인에 대해 위협을 가하는 내용의 게시물, 타인의 자해 행위 또는 자살을 부추기거나 권장하는 내용의 게시물, 타인의 신상정보, 사생활 등 비공개 개인정보를 드러내는 내용의 게시물, 타인을 지속적으로 따돌리거나 괴롭히는 내용의 게시물, 성매매 제안, 알선, 유인 또는 강요하는 내용의 게시물, 공공 안전에 대해 직접적이고 심각한 위협을 가하는 내용의 게시물은 용납되지 않습니다.

③ 관련 법령상 금지되거나 형사처벌의 대상이 되는 행위를 수행하거나 이를 교사 또는 방조하는 등의 범죄 관련 직접적인 위험이 확인된 게시물, 관련 법령에서 홍보, 광고, 판매 등을 금지하고 있는 물건 또는 서비스를 홍보, 광고, 판매하는 내용의 게시물, 타인의 지식재산권 등을 침해하거나 모욕, 사생활 침해 또는 명예훼손 등 타인의 권리를 침해하는 내용이 확인된 게시물은 제한될 수 있습니다.

④ 성적 수치심을 유발시킬 수 있는 내용의 게시물 또는 혐오감을 일으킬 수 있는 폭력적이고 자극적인 내용의 게시물, 본인 이외의 자를 사칭하거나 허위사실을 주장하는 등 타인을 기만하는 내용의 게시물, 과도한 욕설, 비속어 등을 사용하여 혐오감 또는 불쾌감을 일으키는 내용의 게시물은 제한될 수 있습니다.

⑤ 피어 각 개별 서비스의 제공 취지와 부합하지 않는 내용의 게시물과 피어 서비스의 기능을 비정상적으로 이용하여 게재된 게시물은 다른 이용자들의 정상적인 피어 서비스 이용에 불편을 초래하고 더 나아가 피어의 원활한 서비스 제공을 방해하므로 제한될 수 있습니다.

⑥ 피어의 동의 없이 자동화된 수단에 의해 피어에 게시물을 업로드하거나, 업로드된 게시물 또는 광고 등의 컨텐츠에 수정・변조・삭제 등의 영향을 끼치는 행위는 금지됩니다.

여러분의 서비스 이용과 권리침해 예방을 위해 위의 사항에 해당하는 문제가 발생될 경우, 여러분의 게시물 게재나 피어 서비스 이용이 제한될 수 있습니다. 또한 여러분이 게재한 게시물이 관련 법령, 약관, 서비스 운영 규정 등에 위배되는 것으로 판단된다면 부득이 이를 비공개 또는 삭제 처리하거나 게재를 거부할 수 있습니다. 다만, 이것이 피어가 모든 콘텐츠를 검토할 의무가 있다는 것을 의미하지는 않습니다. 또한 이러한 게시물을 올림으로써 발생하는 법적 문제들에 대해서 피어는 적극 소명을 할 수 있으며, 이용자는 모든 행동에 대한 책임을 가지고 있습니다.

## 신고 및 이용자 제한 절차 안내
여러분은 서비스 이용 중 위의 주의사항에 해당하는 컨텐츠를 발견하면 관리자에게 관련 내용을 신고하실 수 있습니다. 신고가 리포트되면 아래와 같은 절차를 따라 처리됩니다.

신고를 받은 이용자의 이용 규정에 대한 위반 소지가 확실시 된 이후에는 제재내용이 결정되면 (일시계정정지, 영구계정정지 등) 대상자에게 이메일로 관련 제재 사항, 사유가 전달됩니다.

제재를 받은 이용자는 관련 제재사항을 전달받은 직후부터 7일 이내로 관리자 이메일 peer@gmail.com으로 이의제기를 할 수 있습니다. 7일이 경과하면 이용자 제한에 이의가 없는 것으로 간주합니다.

위의 주의사항에 어긋난다고 리포트 해주셨던 이용자들께는 해당 이용자의 제재사항, 제재 조치 결과를 전달 드리며, 신고 대상자는 해당 제재를 확정당하게 되며 이와 함께 이유가 되는 게시글, 활동 내역은 모두 블랙리스트화 되어, 기록으로 남게 됩니다. 

## 피어 서비스가 업그레이드 또는 변경될 때 그 내용을 여러분께 알려드리겠습니다.
피어는 여러분과의 소통을 소중하게 생각합니다.
여러분은 언제든지 피어의 고객센터에 접속하여 의견을 개진할 수 있습니다.

피어가 회원에게 개별적으로 통지를 하는 경우 전자메일, 서비스 내 알림 또는 기타 적절한 전자적 수단을 통해 알려 드릴 것이며, 회원 전체에 대한 공지가 필요할 경우엔 7일 이상 피어 초기 화면의 공지사항 등에 관련 내용을 게시하도록 하겠습니다. 개인정보보호법 및 관련 법령에 의거하여 개인정보 수집 및 개인정보 이용과 관련된 내용, 이용 약관의 변경 등은 시행 7일전 사전에 메일, 공지사항을 통해 공지 드릴 예정이며, 이와 관련된 내용은 모두 서비스 내에 보실수 있도록 개시할 것입니다. 

## 피어는 여러분의 개인정보를 소중하게 보호하겠습니다.
피어는 서비스의 제공을 위하여 회원이 동의한 목적과 범위 내에서만 개인정보를 수집・이용하며, 개인정보 보호 관련 법령에 따라 관리합니다. 관련 법령에 의하거나 여러분이 별도로 동의하지 아니하는 한 회사가 여러분의 개인정보를 제3자에게 제공하는 일은 없습니다. 피어가 이용자 및 회원에 대해 관련 개인정보를 안전하게 처리하기 위하여 기울이는 노력이나 기타 상세한 사항은 개인정보 처리방침에서 확인하실 수 있습니다.

## 피어는 정당한 책임을 수행하겠습니다.
피어 커뮤니티는 과실로 인하여 여러분이 손해를 입게 될 경우 본 약관 및 관련 법령에 따라 여러분의 손해를 배상하겠습니다. 다만 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 피어가 서비스를 제공할 수 없거나 이용자의 고의 또는 과실로 인하여 발생된 손해에 대해서는 책임을 부담하지 않습니다. 또한 회사는 관련 법률에 직접적으로 저촉되지 않는 한 간접 손해, 특별 손해, 결과적 손해, 징계적 손해, 및 징벌적 손해에 대한 책임을 부담하지 않습니다. 한편, 회사는 여러분 상호간 또는 여러분과 제3자 상호간에 서비스를 매개로 발생한 분쟁에 대해서는 개입할 의무가 없으며 이로 인한 손해를 배상할 책임도 없습니다.

## 여러분은 언제든지 자유롭게 서비스 이용계약을 해지할 수 있습니다.
회원은 언제든지 피어 서비스 이용계약 해지를 신청하여 회원에서 탈퇴할 수 있으며, 이 경우 피어는 관련 법령 등이 정하는 바에 따라 즉시 처리합니다. 개인정보와 관련된 처리 내용은 개인정보 처리방침을 확인하여 주십시오.

서비스 이용계약이 해지된 경우라도 여러분은 다시 회사에 대하여 이용계약의 체결을 신청할 수 있습니다. 다만, 여러분이 관련 법령, 본 약관 및 세부지침을 준수하지 않아 서비스의 이용이 중단된 상태에서 이용계약을 해지한 후 다시 이용계약 체결을 신청하는 경우에는 통합 서비스 가입과 개별 서비스의 이용에 일정기간 제한이 있을 수 있습니다.

## 여러분이 쉽게 확인 할 수 있는 곳에 이 약관을 게시하고 개정하게 되는 경우에는 사전공지하겠습니다.
이 약관의 내용을 여러분이 손쉽게 확인할 수 있도록 서비스 게시합니다.

피어는 관련 법령을 위배하지 않는 범위 내에서 본 약관을 변경할 수 있습니다. 본 약관이 변경되는 경우, 회사는 변경사항을 시행일자 7일 전부터 여러분에게 서비스 공지사항에서 공지 또는 통지하는 것을 원칙으로 하며, 여러분에게 불리한 내용으로 변경할 경우에는 그 시행일자 30일 전부터 서비스 내에 고지하고 별도의 전자적 수단(이메일 등)을 통해 개별적으로 알릴 것입니다.

피어가 변경된 약관을 게시한 날부터 효력 발생일까지 거부의사가 표시되지 않을 경우에는 여러분이 변경된 약관으로 서비스를 이용하는 데에 동의하는 것으로 간주됩니다. 또한 여러분은 변경된 약관에 대하여 거부의사를 표시함으로써 이용계약의 해지를 선택할 수 있습니다.

이 약관은 한국어를 정본으로 합니다. 약관 또는 피어 서비스와 관련된 여러분과 피어와의 관계에는 대한민국의 법령이 적용됩니다. 그리고 약관 또는 피어 서비스와 관련하여 여러분과 피어 사이에 분쟁이 발생할 경우, 그 분쟁의 처리는 대한민국 '민사소송법'에서 정한 절차를 따릅니다.
`

  return (
    <div>
      <DynamicToastViewer initialValue={policy} />
    </div>
  )
}

export default UsagePolicy
